Revit 2027 API
ConnectorSet.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Connector item
)
Public Overridable Function Erase (
	item As Connector
) As Integer
public:
virtual int Erase(
	Connector^ item
)
abstract Erase :
        item : Connector -> int
override Erase :
        item : Connector -> int
Parameters
item Connector
Return Value
Int32
See Also
Reference
ConnectorSet Class
Autodesk.Revit.DB Namespace